starter-kit-yasnippet.org
#+TITLE: Starter Kit Yasnippet
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

* Starter Kit Yasnippet
** Templates
Configuration of [[http://code.google.com/p/yasnippet/][yasnippet]] templates
#+begin_src emacs-lisp
  (add-to-list 'load-path
               (expand-file-name  "yasnippet"
                                  (expand-file-name "src"
                                                    starter-kit-dir)))
  (require 'yasnippet)
  (yas/initialize)

  (yas/load-directory (expand-file-name "snippets" starter-kit-dir))

  (defun yas/org-very-safe-expand ()
    (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))

  (defun yas/org-setup ()
    ;; yasnippet (using the new org-cycle hooks)
    (make-variable-buffer-local 'yas/trigger-key)
    (setq yas/trigger-key [tab])
    (add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
    (define-key yas/keymap [tab] 'yas/next-field))

  (add-hook 'org-mode-hook #'yas/org-setup)
#+end_src

** Combining with autocomplete
#+begin_src emacs-lisp
  (require 'auto-complete-config)
  ;;(add-to-list 'ac-dictionary-directories (concat starter-kit-dir "snippets/auto-complete-dict"))
  (ac-config-default)
  (define-key ac-completing-map (kbd "ESC") 'ac-stop)
#+end_src
