starter-kit-yasnippet.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Yasnippet</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Starter Kit Yasnippet"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-19T14:27+0200"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="stylesheets/styles.css">
             <link rel="stylesheet" href="stylesheets/org-pygments.css">

</head>
<body>

<div id="preamble">
<span><a title="home page" class="" href="http://xgarrido.dyndns.org/">home</a></span>
                     <span><a title="about" class="" href="http://xgarrido.dyndns.org/">about</a></span>
                     <span><a title="publication" class="" href="http://xgarrido.dyndns.org/">publication</a></span>
                     <span><a title="vitae" class="" href="http://xgarrido.dyndns.org/">vitae</a></span>
                     <span><a title="categories" class="" href="http://xgarrido.dyndns.org/">categories</a></span>
                     <span><a title="links" class="" href="http://xgarrido.dyndns.org/">links</a></span>
                     <span><a title="subscribe by RSS" class="" href="http://xgarrido.dyndns.org/">subscribe</a></span>
                     
</div>

<div id="content">
<h1 class="title">Starter Kit Yasnippet</h1>

<p>This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Starter Kit Yasnippet</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Templates</h3>
<div class="outline-text-3" id="text-1-1">

<p>Configuration of <a href="http://code.google.com/p/yasnippet/">yasnippet</a> templates
</p>


<pre class="src src-emacs-lisp">(add-to-list 'load-path
             (expand-file-name  <span class="org-string">"yasnippet"</span>
                                (expand-file-name <span class="org-string">"src"</span>
                                                  starter-kit-dir)))
(<span class="org-keyword">require</span> '<span class="org-constant">yasnippet</span>)
(yas/initialize)

(yas/load-directory (expand-file-name <span class="org-string">"snippets"</span> starter-kit-dir))

(<span class="org-keyword">defun</span> <span class="org-function-name">yas/org-very-safe-expand</span> ()
  (<span class="org-keyword">let</span> ((yas/fallback-behavior 'return-nil)) (yas/expand)))

(<span class="org-keyword">defun</span> <span class="org-function-name">yas/org-setup</span> ()
  <span class="org-comment-delimiter">;; </span><span class="org-comment">yasnippet (using the new org-cycle hooks)</span>
  (make-variable-buffer-local 'yas/trigger-key)
  (setq yas/trigger-key [tab])
  (add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
  (define-key yas/keymap [tab] 'yas/next-field))

(add-hook 'org-mode-hook #'yas/org-setup)
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Combining with autocomplete</h3>
<div class="outline-text-3" id="text-1-2">




<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">auto-complete-config</span>)
<span class="org-comment-delimiter">;;</span><span class="org-comment">(add-to-list 'ac-dictionary-directories (concat starter-kit-dir "snippets/auto-complete-dict"))</span>
(ac-config-default)
(define-key ac-completing-map (kbd <span class="org-string">"ESC"</span>) 'ac-stop)
</pre>

</div>
</div>
</div>
</div>

</body>
</html>
